LevelData = {}
LevelData.__index = LevelData
LevelData.LevelNumber = 1
LevelData.СountHelp = 50

function LevelData:new(_Number, _Code, _Height, _Width, _Words, _AnswerKey, _Language)
	local item = {Number = _Number , Code = _Code, Height = _Height, Width = _Width, Words = _Words, AnswerKey = _AnswerKey, Language = _Language}
	setmetatable(item, self)
	return item
end

-- Не знаю какой вариант хранения нужен поэтому задаю напрямую.
Levels = {}
Levels[1] = LevelData:new(1, 'DREAAMPMÁ', '3', '3', 'MAMÁ PADRE', '74123 6589', 'ES')
Levels[2] = LevelData:new(1, 'ARWEEHYTI', '3', '3', 'YEAR WHITE', '7412 36985', 'EN')
Levels[3] = LevelData:new(1, 'ГОДКДОУБМ', '3', '3', 'ДОМ КУБ ГОД', '123 478 569', 'RU')
Levels[4] = LevelData:new(2, 'МУШХРЫСАМТШНАРЕФ', '4', '4', 'ШУМ ХАН СЫР ШЕФ МАРТ', '321 4812 111516 9131410 765', 'RU')
Levels[5] = LevelData:new(3, 'РОВЛИФДАГАЗИСММОРНЛОАНМАОВАНИШ', '6', '5', 'ФИЛВОРД СЛОВО МАГАЗИН РОМАН МАШИНА', '6543217 1319252620 148910111218 1716152122 232430292827', 'RU')
Levels[6] = LevelData:new(4, 'ЛЮЧИАСТКНОЖПТААИБОТАБСЛОФОБАОЬМТЕЛРРТОКАБААВДОМАН', '7', '7', 'АВТОМОБИЛЬ РОСА КЛЮЧИ НОЖ ПАСТА БАРАБАН ТАБЛЕТКА ФОТО ДОМ', '43443738312417162330 36292215 81234 91011 1256714 1320273433323940 25261918 21283542414849 454647', 'RU')						  
Levels[7] = LevelData:new(5, 'КОРАТСРЕДГДЕРВРЕОНИОИСТАЯКТОГРНПНРИОАРОАООЕНАЗВАКЭЗНДАМАПССКАВРНАНАЛТАЗЫКАСДАЬАТЯМАГААРНИИБУЛОДКИНКЦ', '10', '10', 'БУМАГА ЯЗЫК КОРРЕСПОНДЕНТ ДИНОЗАВР ЛОДКА АВАРИЯ АНАНАС СТРЕКОЗА МАНДАРИН СПАЛЬНИК ЦИТАТА ЭКСКАВАТОР ГОРА ЕДИНОРОГ', '9394959686 919282838485 81717273 89191828383929 10203040 65151626364656 5060594948473727177 1009080706979 41424343525 1121314151616263 12313122232425253433323 5857676878888999 5565667677879798 454454647475', 'RU')